Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཨ་མོ་ག་ཧྲྀ་ད་ཡ་པདྨ་ཀུ་ལ་ས་མ་ཡཱ་ཡ་ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཕཊ་ཕཊ་ཕཊ་སྭཱ་ཧཱ།
en: You are the amogha essence! Hūṁ hūṁ phaṭ, phaṭ phaṭ!

source: སྙིང་པོའི་གཟུངས་ཀྱི་ཕྱག་རྒྱ་འདི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་འདུས་པར་གསུངས་པ་ཙམ་གྱི་མོད་ལ།
en: Svāhā to you, the samaya of the lotus family!”

source: རི་དང་ནགས་དང་། དགོན་པར་བཅས་པ་རྣམ་པར་འགྱུར་བ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་ཏེ། མེ་ཏོག་གི་ཆར་ཆེན་པོ་མངོན་པར་བབ་པོ། །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: As soon as this heart dhāraṇī-mudrā was pronounced in the great assembly, the earth with its mountains, forests, and groves quaked in six different ways, a great rain of flowers fell, and the devas, nāgas, yakṣas, and gandharvas uttered cries of joy.

source: དྲི་ཟ་རྣམས་དང་། ཅ་ཅོའི་སྒྲ་ཆེན་པོ་རིང་དུ་སྒྲོག་པར་བྱེད་དོ། །དོན་ཡོད་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོའི་སྙིང་པོ་འདི་གསུངས་པའི་དེ་མ་ཐག་ཏུ་གནོད་སྦྱིན་དང་། སྲིན་པོ་གདུག་པ་ཐམས་ཅད་དང་། ལོག་འདྲེན་གདུག་པ་ཅན་རྣམས་ཁས་ཕུབ་ཏུ་འགྱེལ་ཏེ་འབར་ཞིང་ཕྱོགས་ཀྱི་གནས་བསྐྱོད་ཅིང་ཁ་ཕྱིར་ཕྱོགས་སོ།
en: As soon as this essence of the sovereign rite of Amoghapāśa was spoken, all the wicked yakṣas, rākṣasas, and vināyakas fell face down and were terrified as they were consumed by burning flames.

source: །བགེགས་དང་། ལོག་འདྲེན་རྣམས་ཕྱོགས་བཅུར་འབྲོས་པར་བྱེད་དོ། །ངུ་བཞིན་དུ་རྒྱུག་པར་བྱེད་ཅིང་། སྤ་གོང་ཞིང་ཀུན་ཏུ་འཁྱམ་མོ།
en: The vighnas and vināyakas made sorrowful expressions as they fled in the ten directions, wailing as they scattered and cowered in confusion.

source: འདིར་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ལྷ་རྫས་ཀྱི་རྒྱན་དང་། གོས་དང་། རས་བཅོས་བུ་རྣམ་པ་སྣ་ཚོགས་པས་མཆོད་པར་བྱེད་ཅིང་།
en: Because of this samaya dhāraṇī, the great bodhisattva beings will worship Noble Avalokiteśvara with offerings of various divine adornments and fine fabrics.

source: ཆོས་ཀྱི་དགའ་བ་རྗེས་སུ་སྦྱིན་པར་བྱེད་དོ།
en: They will pass on the gift of Dharma.

source: །ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་དང་། ལྷ་རྫས་ཀྱི་དྲིའི་མཆོད་པ་བྱེད་པར་གྱུར་ཏོ། །དེ་ནས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་མེ་ཏོག་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: They will worship him with offerings of various flowers and divine fragrances.

source: ལྷ་རྫས་ཀྱི་གོས་དང་། སྤུད་པ་དང་། རྒྱན་དང་། ལྷབ་ལྷུབ་སྣ་ཚོགས་པ་ཐོགས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ག་ལ་བ་དེ་ལོགས་སུ་དོང་སྟེ་ལྷགས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་།
en: Devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas will approach Noble Avalokiteśvara, the great bodhisattva being who sits opposite the Tathāgata, and make generous offerings with the various flowers, fragrances, garlands, unguents, scented powders, garments, banners, flags, divine fabrics, adornments, ornaments, and decorations they brought.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་མཆོད་པ་ཆེས་ཆེ་བ་བྱེད་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་མཆོད་པ་འགུགས་པ་ནི་མཆོག་ཏུ་རྙེད་པར་དཀའོ། །དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་འདི་དང་།
en: They will make offerings to the blessed lord Noble Avalokiteśvara, the great bodhisattva being, a great pure being who is extremely difficult to find.

source: དོན་ཡོད་པའི་རས་རིས་ཀུན་ཏུ་བལྟ་བའི་སྙིང་པོ་འདི་གསུངས་པ་འདི་ནི་དག་པའི་སེམས་དཔའ་ཆེན་པོའོ། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དག་པའི་སེམས་དཔའ་ཆོ་ག་ཤིན་ཏུ་རྒྱས་པ་ཤོད་ཅིག །
en: The Blessed Śākyamuni then said to Avalokiteśvara, the great bodhisattva being, “Pure being, now teach the full procedure!”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུངས་འདིའི་དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པ་ཤིན་ཏུ་རྒྱས་པ་བཤད་དོ། །གཟུངས་འདིའི་དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པ་ནི་རིག་སྔགས་འཆང་དེས་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ཉི་མ་རེ་རེར་སྟོང་རྩ་བརྒྱད་དུ་བཟླས་པས།
en: Noble Avalokiteśvara, the great bodhisattva being, then gave a detailed explanation of his dhāraṇī, a miraculous amogha manifestation: “This dhāraṇī, a miraculous amogha manifestation, should be recited by the vidyā holder one thousand and eight times every single day while he is absorbed through the illusion-like samādhi into the heart essence of Amogharāja.

source: སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱིས་གཟུགས་རྣམ་པ་སྣ་ཚོགས་པ་ཡང་དག་པར་མཐོང་བ་དང་། སྒྱུ་མ་ཡང་དག་པར་མཐོང་བའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་འཕྲུལ་དེ་ཐམས་ཅད་རྗེས་སུ་འཛིན་པར་འགྱུར་ཞིང་།
en: The vidyā holder will subsequently experience visions of various illusory forms that are magical products of his samādhi.

source: ཐམས་ཅད་དུ་རྗེས་སུ་ཞུགས་པར་འགྱུར་ལ།
en: He will be able to enter anywhere, always in alignment with the course of his samaya.

source: ཐམས་ཅད་དུ་དམ་ཚིག་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་ཏེ། ཐམས་ཅད་དུ་ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་དང་གསང་སྔགས་ཀྱི་ཆོ་ག་ཞིབ་མོའི་རྗེས་སུ་རབ་ཏུ་གནས་པར་འགྱུར་རོ།
en: He will fully understand mudrās, maṇḍalas, mantras, and rites.

source: །ཐམས་ཅད་དུ་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་བ་རྒྱལ་མཚན་གྱི་མཆོག་གཅེས་བྱ་བ་ལ་གནས་ཏེ།
en: He will be able to maintain, at all times, the state known as the top of the banner, a magical product of his samādhi.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་རྗེས་སུ་སོན་ཅིང་རྗེས་སུ་ཞུགས་པར་འགྱུར་རོ། །དོན་ཡོད་པའི་རིག་སྔགས་ཀྱི་དངོས་གྲུབ་ཡོངས་སུ་རྫོགས་པ་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ།
en: He will be able to trace and fully fathom every mystery of the tathāgatas, thus becoming established in amogha vidyā, the perfection of complete knowledge. “

source: །དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པ་དང་ལྡན་པར་འགྱུར་རོ། །དོན་ཡོད་པའི་གཟུགས་དང་། ཁ་དོག་དང་། རྟགས་དང་། དབྱིབས་དང་མཐུན་པར་འགྱུར་རོ།
en: He will obtain magical amogha powers and a complete array of amogha forms, complexions, and marks.

source: །དོན་ཡོད་པའི་ཡོན་ཏན་ཡོངས་སུ་བསྒྲགས་པ་དང་ལྡན་པར་འགྱུར་རོ། །དོན་ཡོད་པའི་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་འགྱུར་རོ། །དོན་ཡོད་པའི་དེ་བཞིན་གཤེགས་པ་ལུང་བསྟན་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: He will obtain amogha qualities, amogha praise, amogha roots of virtue, and an amogha prophecy from the tathāgatas about his future awakening.

source: །དོན་ཡོད་པའི་དེ་བཞིན་གཤེགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་རོ།
en: The amogha heap of great merit and amogha roots of virtue that he plants will be as great as those of the tathāgatas.

source: །དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་མངོན་སུམ་དུ་མཐོང་ཞིང་བྱིན་གྱིས་རློབ་པ་དང་ལྡན་པར་འགྱུར་རོ།
en: He will obtain a direct amogha vision of, and an amogha blessing from, the tathāgatas.

source: །དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་རྗེས་སུ་ཞུགས་པར་འགྱུར་རོ། །དོན་ཡོད་པར་རྡོ་རྗེའི་རིགས་ལ་མཉམ་པར་རྗེས་སུ་ཞུགས་པར་འགྱུར་རོ། །དོན་ཡོད་པར་པདྨའི་རིགས་ཀྱི་དམ་ཚིག་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ། །དོན་ཡོད་པའི་ནོར་བུའི་རིགས་ཀྱི་དམ་ཚིག་རྗེས་སུ་འཛིན་པར་འགྱུར་རོ། །དོན་ཡོད་པར་རྒྱལ་པོའི་རིགས་ཀྱི་དམ་ཚིག་རྗེས་སུ་འཛིན་པར་འགྱུར་རོ།
en: He will be amogha-inducted into the tathāgata family, amogha-inducted into the vajra family, amogha-established in the samaya of the lotus family, amogha-accepted into the samaya of the jewel family, and amogha-accepted into the samaya of the royal family.

source: །དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྣམ་པར་འཕྲུལ་བ་བྱིན་གྱིས་རློབ་པའི་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ། །དོན་ཡོད་པར་འཁོར་ལོས་སྒྱུར་བའི་རིགས་དབང་དུ་གྱུར་ནས་རབ་ཏུ་གནས་པར་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: He will be amogha-established in the magical maṇḍala of all the tathāgatas and will be amogha-established and reside in in the cakravartin family. “

source: །དོན་ཡོད་པ་རིག་སྔགས་ཀྱི་དབང་གིས་མངོན་པར་དབང་བསྐུར་བར་འགྱུར་རོ།
en: Through amogha consecration, he will be initiated into amogha knowledge.

source: །དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མངོན་པར་དབང་བསྐུར་བས་མངོན་པར་དབང་བསྐུར་བར་འགྱུར་རོ། །དོན་ཡོད་པར་ཕྱག་རྒྱ་ཆེན་པོ་རིམ་པར་ཕྱེ་བ་དང་། གསང་སྔགས་ཀྱི་སྒྲུབ་ཐབས་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ།
en: He will receive the amogha consecration of all the tathāgatas and be amogha-established in the practice of the great mudrā and mantra collections.

source: །དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་ཉེ་བར་འགྲོ་བར་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ། །དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་བ་བསྐོར་བར་འགྱུར་རོ།
en: He will be amogha-established on the path to the final awakening of the tathāgatas and will amogha-turn the wheel of the Dharma of all the tathāgatas.

source: །དོན་ཡོད་པར་ཆོས་ཀྱི་རྔ་བོ་ཆེ་རྡུང་བར་འགྱུར་རོ། །དོན་ཡོད་པར་ཆོས་ཀྱི་དུང་འབུད་པར་འགྱུར་རོ།
en: He will become the amogha drummer who beats the drum of Dharma and the amogha conch-blower who blows the conch of Dharma.

source: །དོན་ཡོད་པར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: He will amogha-master the six perfections.

source: །དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྙིང་བོར་འགྱུར་རོ། །དོན་ཡོད་པར་ཐོས་པ་ཟབ་མོ་ཆོས་དབྱིངས་ཀྱི་སྙིང་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: His nature will be the amogha nature of the dharmadhātu of all the tathāgatas, and he will obtain the profound dharmadhātu nature through the amogha transmission.

source: །དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་ལས་འདས་པའི་ལམ་གྱི་ཡན་ལག་བརྒྱད་དང་ལྡན་པར་འགྱུར་རོ།
en: He will amogha-enter the noble eightfold path of all the tathāgatas that leads beyond this world.

source: །དོན་ཡོད་པར་འཇིག་རྟེན་པ་དང་ཐུན་མོང་བའི་ཆོས་ཆོ་ག་ཞིབ་མོའི་སྒྲུབ་པའི་དངོས་གྲུབ་ཆེན་པོ་སོ་སོར་ཐོབ་བོ། །དོན་ཡོད་པར་འཇིག་རྟེན་བའི་ལྷའི་དཔལ་ཉམས་སུ་མྱོང་ངོ་།
en: He will amogha-accomplish the worldly practice of the great common Dharma rites and will amogha-enjoy the divine-worldly splendor.

source: །དོན་ཡོད་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་བླ་མར་བྱེད་པ་དང་། གུས་པར་བྱེད་པ་དང་། སྤྱི་བོར་འཇོག་པར་འགྱུར་རོ།
en: He will become the supreme amogha master of all beings and occupy the position of honor above their heads. “

source: །དེ་བཞིན་དུ་ཚོགས་ཆེན་པོའི་ཡོན་ཏན་དང་ལྡན་པ་དང་། ཕན་ཡོན་ཆེན་པོ་རྗེས་སུ་སོན་བར་འགྱུར་རོ། །དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོ་རིམ་པར་ཕྱེ་བ་དང་བཅས་པ་ལ་ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་གྱི་སྒྲུབ་པ་དང་། ཞགས་པའི་ཆོ་ག་མཐའ་དག་རྫོགས་པ་གང་ཡིན་པ་འདི་ཉན་པར་འགྱུར་བ་དང་། འཆང་བར་འགྱུར་བ་དང་། འདོན་པར་འགྱུར་བ་དང་། ཀུན་ཆུབ་པར་འགྱུར་བ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། བཟླས་པའི་ཆོ་ག་བྱེད་པར་འགྱུར་བ་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་པར་འགྱུར་བ་དེ་དག་སྐྱེ་བ་འདི་ཉིད་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་དང་།
en: He will accumulate many great qualities and experience the corresponding great benefits, provided that he completes all the practice procedures of this essential Amogharāja ritual with its sets of mudrās and maṇḍalas; that he listens to, upholds, propagates, and makes this manual available; and that he reflects on it deeply, recites the mantras according to procedure, and recollects the Buddha.

source: སྡིག་པ་ཐམས་ཅད་ཡོངས་སུ་དག་ཅིང་བསལ་བར་འགྱུར་རོ། །ནད་ཐམས་ཅད་དང་། སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་།
en: If he does this, he will purify and exhaust his karma, all his wrongdoings, and all his obscurations in this very life and will be completely free from disease, birth, old age, and death.

source: འཆི་བ་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ། །འཁོར་བའི་རྒྱ་མཚོའི་ཆུ་བོའི་ཕ་རོལ་ཏུ་འགྲོ་བར་འགྱུར་རོ།
en: He will reach the other shore of the ocean of saṃsāra.

source: །བཅོམ་ལྡན་འདས་འོན་ཀྱང་གང་ལ་ལ་ཞིག་སེམས་ཅན་ཆེས་མང་པོ་ལ་དབང་བྱེད་པར་འགྱུར་ཏེ།
en: If this is so, O Blessed One, what need is there to mention someone who is primarily dedicated to serving sentient beings?

source: དེ་ཡང་བཅོམ་ལྡན་འདས་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བགྱིའོ། །ས་བཅུ་ལ་རབ་ཏུ་གནས་པ་དང་བཅས་པར་བརྗོད་པར་བགྱིའོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་ལ་ལ་ཞིག་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་འདི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ཆེན་པོ་དང་། ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་དང་།
en: It is said that such a being should be known, O Blessed One, as one who never turns back, the same as one who is established on the tenth bodhisattva level. “

source: རས་རིས་ཡོངས་སུ་དག་ནས་དད་པ་དང་གུས་པ་ཡིད་ལ་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལྷག་པའི་བསམ་པ་རབ་ཏུ་དང་བས་འདྲི་བར་འགྱུར་རོ། །འདྲི་མཁན་དད་པ་དང་། གུས་པ་དང་། བྱམས་པ་ཡོངས་སུ་དག་པའི་ཡིད་ཀྱིས་ཡོ་བྱད་ཡོངས་སུ་མ་ཚང་བ་མེད་པའི་མཆོད་པ་དང་།
en: If, O Blessed One, a son or a daughter of good family, a monk or a nun, or a male or female lay practitioner draws, on a fine, thoroughly cleaned cotton cloth, the following emblematic maṇḍala from the great sovereign rite that constitutes the heart essence of Amogharāja; if they draw it with due attention, faith, and respect while wholly intent on supplicating all the tathāgatas; if they draw it or commission a painter who has faith, respect, and a pure mind filled with loving kindness, a painter who uses flawless materials in respectful worship; if they draw this maṇḍala for the sake of all beings, the strong and the weak, such a person should be known as one who is established irreversibly on the path to awakening.

source: བསྙེན་བཀུར་བའི་འདྲི་མཁན་གྱིས་བྲི་བའམ་འདྲིར་གཞུག་པར་འགྱུར་རོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྟོབས་དང་མཐུས་བྲིས་པའི་སེམས་ཅན་དེ་ཡང་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བགྱི་སྟེ། འདི་ལ་དོགས་པ་དང་ཡིད་གཉིས་བསྐྱེད་པར་མི་བགྱིའོ། །གཞན་ཡང་སེམས་ཅན་འདི།
en: This should not be doubted or denied.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཐུགས་ལས་སྐྱེས་པའི་སྲས་སུ་རིག་པར་བགྱི། ཞལ་ལས་སྐྱེས་པ་དང་།
en: All the tathāgatas will regard them like their own firstborn son.

source: །ཆོས་ལས་སྐྱེས་པ་དང་། ཆོས་ཀྱི་སྦྲུལ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་བརླབས་པར་འགྱུར་ཏེ། སེམས་ཅན་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་ལུང་བསྟན་ཏོ།
en: Being a product of the Dharma, fashioned by the Dharma, they will be blessed by all the tathāgatas and prophesied to become a supreme being and to fully realize perfect awakening.

source: །དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་བའི་ཕྱིར་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པ་ཉིད་དུ་རིག་པར་བགྱིའོ།
en: Because of its great miraculous power, this sovereign rite should therefore be known to be equal to a tathāgata.

source: །དེའི་ཕྱིར་འདིའི་ཕན་ཡོན་དང་ཡོན་ཏན་ཆེན་པོ་ཡོངས་སུ་བསྒྲགས་སོ།
en: As such, it is famed to bring great benefits and great qualities. “

source: །དེ་ནས་དོན་ཡོད་པའི་དངོས་གྲུབ་བླ་ན་མེད་པའི་ཡོ་བྱད་དང་ཆོ་ག་བཤད་པར་བགྱི་སྟེ།
en: I will now describe the practice procedure that leads to the supreme amogha accomplishment. “

source: རས་ཁྲུ་གཉིས་པའི་ཚད་དུ་བགྱི་ཞིང་། ཀུན་ནས་གྲུ་བཞི་པ། ཤིན་ཏུ་གསལ་བ། ཤིན་ཏུ་བཏགས་པ།
en: The vidyā holder should prepare a square, symmetrical, well-woven canvas that is two cubits wide.

source: ཤིན་ཏུ་གསར་བ། ལེགས་པར་བཅགས་པ་ལ།
en: It should be new and well pressed.

source: རི་མོ་མཁན་གཙང་མ་གོས་གཙང་མ་བགོས་པས།
en: The painter should purify himself ritually, put on clean clothes, and execute the painting using strong, vividly colored paints that are free of contaminants and kept in new vessels.

source: ཆང་དང་། ཤ་དང་། ཀུན་དོང་དང་། སྒོག་སྐྱ་དང་། ཀེའུ་དང་འདྲེས་པ་དང་།
en: He should abstain from consuming alcohol, meat, onion, garlic, red onion, or foods containing these ingredients.

source: སྦགས་པ་དང་། ཁ་ཟས་ངན་པ་ཡོངས་སུ་སྤངས་པས་ཚོན་རྣམ་པ་སྣ་ཚོགས་པ་འབར་བ་ལྷག་མ་མ་ཡིན་པ་སྣོད་གསར་པར་བཞག་པས་འདྲིར་གཞུག་པར་བགྱི་སྟེ།
en: He should also avoid eating leftovers or food that has gone off.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་བརྙན་རི་མོར་བགྱིའོ། །དོན་ཡོད་པའི་ཞགས་པ་ཞི་བའི་ཞལ་སྤྱན་གསུམ་པ་རལ་བའི་ཅོད་པན་གྱིས་བརྒྱན་པ་ཞལ་བཅུ་གཅིག་པ་བགྱི་སྟེ། ཕྱག་སུམ་ཅུ་སོ་གཉིས་པ།
en: The form to be painted is that of Noble Avalokiteśvara as Amoghapāśa, who has a gentle expression on his main face, three eyes, hair tied in a topknot and adorned with a diadem, eleven faces, and thirty-two arms.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། ཕྱག་ན་མཚོན་ཆ་སྣ་ཚོགས་པ་དང་ཞགས་པ་ཐོགས་པ།
en: He is adorned with all ornaments and holds in his hands various implements, including the noose.

source: པདྨ་དཀར་པོའི་ལུས་དང་ཁ་དོག་ཅན། སྣ་ཚོགས་པའི་གོས་འཆང་བ།
en: His body color is lotus white, and he wears various garments. “

source: ཞལ་གཡས་པ་དབང་ཕྱུག་ཆེན་པོའི་ཞལ། གཡོན་པ་སྲེད་མེད་ཀྱི་བུའི་གཟུགས་འཛིན་པ།
en: The face to the right of the main face is that of Maheśvara, and the one to the left, Nārāyaṇa.

source: དབང་ཕྱུག་ཆེན་པོའི་སྟེང་དུ་གཤིན་རྗེའི་གཟུགས། སྲེད་མེད་ཀྱི་བུའི་སྟེང་དུ་ཆུ་ལྷའི་གཟུགས།
en: Above Maheśvara is the face of Yama, and that above Nārāyaṇa is Varuṇa.

source: གཤིན་རྗེའི་སྟེང་དུ་ལུས་ངན་གྱི་གཟུགས།
en: The face above Yama is Kubera, who frowns, while above Varuṇa is the frowning face of Kumāra.

source: ཞལ་ཁྲོ་གཉེར་ཅན། ཆུ་ལྷའི་སྟེང་དུ་གཞོན་ནུ་ཞལ་ཁྲོ་གཉེར་ཅན། ལུས་ངན་གྱི་སྟེང་དུ་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་དྲག་པོ་མཆེ་བ་གཙིགས་པའོ།
en: The face of the wrathful Maheśvara with protruding fangs sits above Kubera, and above Kumāra is the face of Īśvara in his wrathful form with protruding fangs.

source: །གཞོན་ནུའི་སྟེང་དུ་དབང་ཕྱུག་དྲག་པོའི་གཟུགས་མཆེ་བ་གཙིགས་པའོ། །དབང་ཕྱུག་གི་སྟེང་དུ་ཉི་མའི་ཞལ། དབང་ཕྱུག་ཆེན་པོའི་སྟེང་དུ་ཟླ་བའི་ཞལ།
en: Above Īśvara is the face of Āditya, and above the wrathful Maheśvara is the face of Soma.

source: སྟེང་གི་རལ་པ་ལ་འཕགས་པ་འོད་དཔག་མེད་འོད་འདོམ་གང་དང་བཅས་པའི་ཕྱག་བརྐྱང་བས་དབུགས་འབྱིན་པར་བྱེད་པའོ།
en: Above Avalokiteśvara’s knotted hair is Noble Amitābha with a halo of light extending for one fathom.

source: །ཕྱག་གཡས་པ་དང་།
en: Amitābha’s right hand is extended in the gesture of giving comfort. “

source: སྐྲའི་བར་དུ་རླུང་ལྷ་བྱ་སྟེ་ལུས་རྫོགས་པའོ།
en: Vāyu should be drawn inside Amitābha’s hair with his body inclined.

source: །གཞོགས་གཡོན་དུ་མེའི་ལྷ་སྟེ་ལུས་ཕྱེད་པའོ།
en: The god Agni should be drawn to Amitābha’s right, with half his body showing.

source: །སྔར་བཤད་པའི་ཕྱག་རྒྱ་དང་མཚོན་ཆ་ལག་ན་ཐོགས་པ་བགྱིའོ།
en: His emblems and implements should be drawn as previously mentioned.

source: །གཡས་སུ་འཕགས་པ་ཁྲོ་བོའི་རྒྱལ་པོ་བགྱི་སྟེ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་ཁྲོས་པའི་གཟུགས་སོ།
en: Noble Krodharāja should be drawn to the right of Avalokiteśvara, with a wrathful form adorned with all the ornaments.

source: །གཡོན་དུ་རིག་པའི་རྒྱལ་པོ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པར་བགྱིའོ།
en: To the left is Vidyārāja, adorned with all the ornaments.

source: །ཁྲོ་བོའི་རྒྱལ་པོ་ནི་པདྨ་དང་ཞགས་པ་ཐོགས་པའོ། །རིག་པའི་རྒྱལ་པོ་ནི་ཡིད་བཞིན་གྱི་ནོར་བུ་དང་། མེ་ཏོག་གི་ཕུར་མ་ཐོགས་པར་བགྱིའོ།
en: Krodharāja holds a lotus and a noose, while Vidyārāja holds a wish-fulfilling jewel in hands cupped like the calyx of a flower.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ནི་ཞལ་ནས་འོད་ཟེར་འཕྲོ་བཞིན་པ་བགྱི་སྟེ། པདྨའི་གདན་དང་། ལུས་ལ་པདྨའི་ཕྲེང་བ་འཕྱང་བའོ།
en: Noble Avalokiteśvara’s main face is turned upward, and his body, seated on a lotus, is adorned with lotus garlands. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་འོག་གི་པདྨ་ལ། དཀྱིལ་འཁོར་གྱི་ལྷ་མོ་བགྱི་སྟེ།
en: The goddess of the maṇḍala should be drawn below the lotus on which Noble Avalokiteśvara sits.

source: དྲག་མོ་དྲག་ཏུ་དགོད་པ། ཕྱག་བཞི་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ།
en: She is in her wrathful form, is laughing loudly, has four arms, and is adorned with every ornament.

source: པདྨ་དང་། ཞགས་པ་དང་། དགྲ་སྟ་དང་། རལ་གྲི་ཐོགས་པ།
en: In her four hands she holds a lotus, a noose, an axe, and a sword.

source: པདྨའི་གདན་ལ་སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས་པ་བགྱིའོ།
en: She is sitting on a lotus in the ardhaparyaṅka posture.

source: །ཁྲོ་བོའི་རྒྱལ་པོའི་རྒྱབ་ཏུ་འཕགས་པ་སྒྲོལ་མ་བགྱི་སྟེ། ཕྱག་ན་གོས་འཛིན་པ་དབུ་སྨད་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པའོ།
en: Behind Krodharāja is Noble Tārā; she holds a white cloth in her hands, her head is slightly inclined, and she is adorned with every ornament.

source: །རིག་པའི་རྒྱལ་པོའི་རྒྱབ་ཏུ་དཀར་ཤམ་ཆེན་མོ་བགྱི་སྟེ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། ཕྱག་ཐལ་མོ་སྦྱར་ཞིང་མགོ་སྨད་པའོ།
en: Behind Vidyārāja is Mahāśvetā, who is adorned with every ornament, has her hands in the añjali gesture, and slightly inclines her head. “

source: །དཀྱིལ་འཁོར་གྱི་ལྷ་དེ་དག་གི་བར་དུ་གཡས་ངོས་སུ་རིག་སྔགས་འཆང་པུས་མོ་བཙུགས་པ་བགྱི་སྟེ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞལ་ལ་བལྟ་བཞིན་པ་ལག་ན་མེ་ཏོག་གི་ཕོར་པ་ཐོགས་པ་བགྱིའོ།
en: The vidyā holder should be drawn on the right side among the maṇḍala deities, kneeling on one knee and looking at the face of Noble Avalokiteśvara while holding a vase with flowers.

source: །ངོས་བཞི་རུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་རི་མོ་བགྱི་སྟེ། སྐྱིལ་མོ་ཀྲུང་གིས་བཞུགས་པ།
en: The blessed buddhas, sitting in cross-legged posture, should be drawn on the four sides of Noble Avalokiteśvara.

source: དཀྱིལ་འཁོར་གྱི་རྣམ་པ་སུམ་ཅུ་རྩ་བརྒྱད་རྣམ་པར་འབྱེས་པར་བགྱིའོ།
en: There are thirty-eight figures in the maṇḍala.

source: །སྟེང་དུ་སོན་པར་དྲང་སྲོང་རྣམས་དང་ལྷའི་བུ་བགྱིའོ།
en: In the space above are ṛṣis and devas.

source: །གྲྭ་བཞི་རུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བགྱི་སྟེ། གོ་ཆ་དང་ཡ་ལད་བགོས་པའོ།
en: The Four Great Kings, wearing cuirasses and coats of mail, are in the four corners.

source: །ཞབས་དག་གི་འོག་ཏུ་དཔལ་ལྷ་མོ་དང་། དབྱངས་ཅན་དང་། འཇིགས་མ་དང་། མཚན་མོའི་ལྷ་མོ་རྣམས་བགྱིའོ།
en: The three goddesses Sarasvatī, Bhīmā, and Rātri should be drawn below the feet of the goddess Śrī. “

source: །རས་རིས་ཡོངས་སུ་རྫོགས་པ་ལེགས་པར་བགྱིས་ཤིང་། ལས་བགྱིས་པ་བྲིས་ནས་དེའི་འོག་ཏུ་གསང་བའི་གནས་སུ་བཞག་སྟེ།
en: When the canvas has been filled in and the painting finely executed and finished, the vidyā holder should set it in a hidden place.

source: ཕྱོགས་གཙང་མར་བ་བྱུང་གི་དཀྱིལ་འཁོར་བགྱི་སྟེ། ཀུན་ནས་གྲུ་བཞི་པ་བགྱིའོ།
en: He should then use cow dung to demarcate a symmetrical four-cornered maṇḍala in a clean spot.

source: །དེའི་སྟེང་དུ་དྲི་སྣ་ཚོགས་ཀྱི་བྱུག་པ་སྦྱིན་པར་བགྱི། མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཅལ་དུ་དགྲམ་པར་བགྱི། གང་བའི་བུམ་པས་སྤྲས་པར་བགྱི། ཕོག་ཕོར་གྱིས་སྤྲས་པར་བགྱིའོ། །ཙནྡན་དང་། ཀུན་དུ་རུ་དང་།
en: He should smear the surface with various fragrant oils, strew it with flowers, and arrange full jars and incense holders around it.

source: ཨ་ག་རུ་དང་། དུ་རུ་སྐ་དང་། གུ་གུལ་གྱི་བདུག་པ་སྲེག་ཅིང་། མཆོད་ཡོན་དང་། ཞབས་བསིལ་ཡང་གཞག་པར་བགྱིའོ།
en: Burning incense of sandalwood, olibanum, agarwood, frankincense, and bdellium, he should add bowls with argha water for the feet.

source: །རས་རིས་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་པར་བཞག་ནས།
en: He should place the painting there in such a way that it faces the maṇḍala. “

source: རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོས་པ། ལེགས་པར་ཁྲུས་བྱས་པས་བགྱི་སྟེ།
en: He should then purify himself ritually, put on clean clothes, and be thoroughly bathed.

source: རས་རིས་ལ་མཆོད་པ་བགྱི་ཞིང་མར་མེ་བཅུ་དྲུག་སྦར་བར་བགྱིའོ།
en: He should then make offerings to the painting and light sixteen lamps.

source: །དེ་ནས་རས་རིས་ལ་མངོན་དུ་ཕྱོགས་ནས་སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་ནས་ཕྱག་རྒྱ་བཅིང་བར་བགྱིའོ། །དོན་ཡོད་པ་ཆེན་པོའི་སྙིང་པོའི་གསང་སྔགས་ཀྱི་གཟུངས་ཀྱི་དམ་ཚིག་སྟོང་ཕྲག་བཅུར་བཟླས་སོ། །དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་དང་།
en: Facing the painting, he should sit in the cross-legged posture and display the mudrā while reciting the great samaya dhāraṇī, an amogha heart mantra, ten thousand times.

source: ཁྲོ་བོའི་རྒྱལ་པོ་དུས་གསུམ་དུ་ལན་ཉི་ཤུ་རྩི་གཅིག་བཟླས་པར་བགྱིའོ།
en: He should also recite, at the three junctions of the day, the Krodharāja mantra, the heart essence of Amogharāja, twenty-one times.

source: །སྟོང་ཕྲག་བཅུ་རྫོགས་པ་དང་། རིག་སྔགས་འཆང་གི་མགོ་ལ་འབར་བར་བགྱིད་ཅིང་། རས་རིས་དེ་ལ་ཡང་འོད་སྣ་ཚོགས་པ་རྣམས་འབར་བར་བགྱིད་དེ།
en: When he has recited the samaya dhāraṇī ten thousand times, the vidyā holder’s topknot will blaze with light, and the cloth painting will likewise radiate light of various colors. “

source: ཐོ་རངས་སྐྱ་རེངས་སེར་པོའི་ཐུན་མཚམས་ཀྱི་དུས་ཚོད་ལ་ཇི་ལྟ་བ་བཞིན་དུ་རས་རིས་མངོན་པར་འདྲི་ན། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལྷའི་ལུས་ཀྱིས་མདུན་དུ་འདུག་སྟེ་རིག་སྔགས་འཆང་ལ་དབུགས་འབྱིན་པར་བགྱིད་ཅིང་། དེ་བཞིན་དུ་སྨྲ་བར་བགྱིད་དེ།
en: When day breaks with a golden glow in the early morning, Noble Avalokiteśvara will appear before the vidyā holder in his divine person, just as he was depicted in the cloth painting.

source: རིག་སྔགས་འཆང་སྨྲོས་ཤིག་མཆོག་སྦྱིན་པར་བྱ།
en: He will give comfort to the vidyā holder and say, ‘Tell me, vidyā holder, what boon would you like?

source: ཡིད་ལ་ཇི་ལྟར་འདོད་པ་དེ་དག་ཐམས་ཅད་སྦྱིན་པར་བྱའོ།
en: Whatever is on your mind, I will grant it in full.’

source: །རིག་སྔགས་འཆང་གིས་མཆོག་གཉིས་བླང་བར་བྱ་སྟེ། འཇིག་རྟེན་པའི་མཆོག་གི་དངོས་གྲུབ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་མཆོག་སངས་རྒྱས་ཉིད་དོ།
en: The vidyā holder can request either of two boons: (1) a worldly accomplishment and (2) the supreme accomplishment of transcendent buddhahood.
